In [2]:
import pandas as pd
emt_df = pd.DataFrame()
print(emt_df)

Empty DataFrame
Columns: []
Index: []

In [3]:
lst = ['a', 'b', 'c', 'd', 'f']
print(lst)

['a', 'b', 'c', 'd', 'f']

In [4]:
df1 = pd.DataFrame(lst)
print(df1)

   0
0  a
1  b
2  c
3  d
4  f

In [5]:
df1

   0
0  a
1  b
2  c
3  d
4  f

In [6]:
ls_of_ls = [[1,2,3],[4,5,6],[7,8,9]]
print(ls_of_ls)

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [7]:
df2 = pd.DataFrame(ls_of_ls)
df2

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [10]:
dict1 = {'ID':[11,22,34,54]}
dict1

{'ID': [11, 22, 34, 54]}

In [11]:
df3 = pd.DataFrame(dict1)
df3

   ID
0  11
1  22
2  34
3  54

In [12]:
dict1 = {'ID':[11,22,34,54], 'SN':[21,34,65,23]}
dict1

{'ID': [11, 22, 34, 54], 'SN': [21, 34, 65, 23]}

In [13]:
df3 = pd.DataFrame(dict1)
df3

   ID  SN
0  11  21
1  22  34
2  34  65
3  54  23